Revit 2027 API
BuiltInFailures.SplitToposolidFailures.GenerateNewSplitTopoFailed Property
 Failed to generate new toposolid after split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenerateNewSplitTopoFailed { get; }
Public Shared ReadOnly Property GenerateNewSplitTopoFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenerateNewSplitTopoFailed {
	FailureDefinitionId^ get ();
}
static member GenerateNewSplitTopoFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SplitToposolidFailures Class
Autodesk.Revit.DB Namespace